{
    "csse": [
        {
            "time": "12:30 PM - 12:45 PM",
            "projectId": "csse-2-1230",
            "title": "Sensors and Warning System for Vehicles",
            "studentName": "Mahamadou Diallo",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "./posters/csse/Mahamadou O Diallo.png",
            "abstract": "In the final era of gasoline engine-powered vehicles, vehicle enthusiasts are looking for unique and creative ways to ensure a healthy life of their vehicle which may become priceless in the coming years. This is where driver assistance features for vehicles come into play. Vehicles with driver assistance packages have just started to become a standard in vehicles. For example, it was only in 2014 when all vehicles on and after that year were required to have backup cameras. Normally, it's an option that customers would have to pay additionally for. \n\nTo aid this, I was motivated to create my capstone project around one of the issues I as a vehicle enthusiast have encountered. I assembled and programmed sensors for my vehicle using python, ultrasonic sensors, raspberry pi, breadboard, resistors, and lots of wires. The equipment necessary was cheaper than retrofit sensor kits online with a lot more room for customizability and control. The ultrasonic sensor has two transducers, it sends out an ultrasonic wave and calculates the distance based onthe time it took for the other transducer to receive the wave depending on the air density. The distance is calculated by multiplying the speed of sound and the time it takes for the wave to come back after hitting an object. The value is then divided by 2 because the waves travel and bounce back from its starting pointotherwise time would be double. The ultrasonic sensors would be mounted to an individual's desired location, it was the front of my car for me. The sensor would have its connectors/wires routed through thefirewall into the cabin of the vehicle where it’s connected to a display that would display information. \n\n As a result, a few data points are collected when the sensor is operating. The average distances overtime, minimum and maximum distances, and uptime. I learned the basics of electricity/current and soldering to ensure the longevity of the sensors. Lastly, I set limitations for the sensor to decrease inaccurate reading of distances. Overall, this project serves as a starting point for vehicle enthusiasts who want to add features of a modern vehicle to their own."
        },
        {
            "time": "12:45 PM - 1:00 PM",
            "projectId": "csse-2-1245",
            "title": "DataPhram: Audio and Demographic Data Collection Android Application Using Federated Learning to Train Heartbeat Abnormality ML Model",
            "studentName": "Nicolas Feuchster",
            "studentMajor": "CSSE",
            "projectType": "UWB CSS Faculty Research",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "./posters/csse/Nicolas Feuchster.png",
            "abstract": "Dataphram is an application that I have created, with the help of Dr. Afra Mashhadi, which allows researchers to easily train heartbeat abnormality machine learning (ML) models with the use of any Android phone. I have added three main tabs to this application. The functions of each tab are as follows: Audio: Record audio, stop recording, save audio to a list, playback of audio, side-scrolling visual wave form of the audio; Demographics: Age, sex, and race data collection objects; Assessment: Outputs the risk of the individual having heart disease based off the user’s demographic data and shows a link to the CDC’s website to prevent heart disease. The federated learning is done in the background of the application.\n\nThe core purpose of this project is to help with the global issue of heart disease. Heart Disease is the leading cause of death in men and women in the World. Due to this issue, Dr. Afra Mashhadi has been working with machine learning models to identify various abnormalities in heartbeat audio and asked if I would like to build an application to help with her research.A few problems that have been getting in the way of this current research are the lack of heartbeat audio data online and the possible legality of collecting sensitive medical data. The solution to the first problem of the lack of data is to build an application that easily collects heartbeat audio data/preprocesses the audio to a usable format. The solution to the second problem of the legality of collecting sensitive medical data is to keep that audio data on the individual’s phone itself, which we accomplish by using federated learning.\n\nThe result of this project is that I have developed a mostly functional android application from scratch. It has taught me about markup languages and how to manipulate XML objects, the android application framework, connect an android app to a server(s), manipulate audio to a visual format, and federated learning.\n\nThe impersonal significance of this project is that it may help with preventing the biggest killer in the world, heart disease. The personal significance of this project is that it has taught me a lot about android app development, and federated learning. These skills, I’m positive, will be beneficial in my personal life and future career."
        },
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-2-100",
            "title": "Flower C++ SDK",
            "studentName": "Brendan Hurt",
            "studentMajor": "CSSE",
            "projectType": "UWB CSS Faculty Research",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "./posters/csse/Brendan Quinn Hurt.PNG",
            "abstract": "Federated learning has become an increasingly useful tool for conducting research. Since the process of aggregating and averaging locally trained models results in a global model that is more accurate than if that same model were trained with more traditional machine learning. Flower is an open source federated learning framework, developed by Adap with Pytorch, a popular Python based machine learning framework. Which is being used by several major institutions and companies for research and production. One of the goals of Adap is to have Flower be language and technology independent.\n\nThis project was started to create a proof of concept that could eventually be developed into a fully functional SDK. Which, once completed, would enable users to define machine learning models in libtorch, the C++ API for Pytorch, and federate them with Flower.\n\nThe initial stages of this were familiarizing myself with the technologies that the Flower client uses to communicate with the server. To do this, I created a client class that was capable of serializing and deserializing Protobuf messages, along with sending and receiving these messages via a gRPC bidirectional streaming method. From there, I began to work on a version that performs the other functions of the Flower client, the core of which is having the client  respond to instructions from the server. For example, being able to update its model and train it based on server instructions. This stage of the project is nearly completed. Once finished, there should only be a few additions and alterations to make in order to take it from a proof of concept to a fully functional C++ SDK for Flower."
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-2-115",
            "title": "Valley Medical Contracted Dev",
            "studentName": "Jorge Alvarez",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship - UW Medicine / Valley Medical",
            "facultyAdvisor": "Mr. Alan Leong",
            "posterLink": "./posters/csse/Jorge Alvarez.png",
            "abstract": "During the internship, multiple projects were accomplished for the Valley Medical Center IT department. One of the larger projects accomplished was a redesign of the team pages for the Network and Communications team as well as the System and Security team. These pages acted as their hub to access different portals, sites, and keep documents for the team.\n\nThe purpose of the redesign was to allow for the users to have a better time traversing and using the team sites since a lot of information would be strewn about and many resources were left not updated. The accumulation of out of date resources and lack of organization made the team sites difficult to traverse and organize when attempted. It was also to allow easier on boarding of new team members by making a more user friendly site.\n\nThe result of the project led to a complete redesign of the sites to be able to accomplish the requirements of the users. More functionality was also included into the sites that were not there before, allowing for even more usage of the team sites instead of having to manage services in multiple other locations.\n\nTo accomplish these results, I used an iterative design approach where I would create/update prototypes and hold user/usability tests as well as hold design overviews with whole teams to get feedback. When a prototype has reached an acceptable design, I would implement it then conduct usability tests with the actual site. I used this method because there were a lot of moving parts and individuals using the sites, so a singular waterfall type method would not work well to accomplish all the needs of the users.\n\nThe significance of the redesign made it easier for users to onboard onto the team and have an easier time grasping the layout of the team’s documentation and services. It also allowed current users to have a better time using the sites instead of having bookmark folders of 20+links to different points in the team sites because traversing through the team site itself was too difficult."
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-2-130",
            "title": "Stock Tracking Web Application",
            "studentName": "Ethan Sabini",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Dr. Annuska Zolyomi",
            "posterLink": "./posters/csse/Ethan Sabini.jpg",
            "abstract": "Tracking stock prices and using technical indicators can be very complicated. Learning about the stock market is difficult because of the complexity, ambiguity, a lack of beginner-friendly resources, etc. MyStockWatch is a web application for tracking stock prices, looking at graphs, using technical indicators, managing lists, and looking at the latest financial news on one platform. It is designed so that beginners, as well as intermediate or advanced users, can utilize the application.\n\nThe application was built with React, NodeJS, MongoDB, Express, Auth0, and Bulma. I chose React because of how it handles components and state management. I used NodeJS on the server because it is familiar and efficient. The application includes user authentication, a client/server model, and utilizes the model view controller architecture (MVC). The server is made with a REST API, which stores and retrieves data from the MongoDB database to send to the client. The financial data is retrieved from an API and displayed in React. I used Bulma for the CSS framework so that I could develop the UI faster and use responsive elements easily. The graphical user interface (GUI) is managed through React state with a component-based architecture, which increases modularity, maintainability, and performance.\n\nThe user can add stocks to the dashboard, lists, and favorites to track the stock prices and other technical indicators. Trending news and specific news about a company can be viewed. User profiles and authentication is implemented through Auth0. The user can switch between light and dark mode which was implemented with global styled-components. User studies were conducted and usability was improved through gathered metrics and results.\n\nI learned how to efficiently read the documentation about APIs, frameworks, libraries, etc. I also learned how to thoroughly test and debug web applications on both the client and server. System Design and modularity were important factors in the making of the application. This project was vital for learning React and other framework concepts such as hooks, the shadow DOM, rendering methods, state management, etc. Deploying the project in a production environment taught me how to manage the workspace, environment variables, and more. I learned how to use Docker to containerize and deploy the application, allowing it to be deployed across any cloud platform. Performance, Search Engine Optimization (SEO), Best Practices, and Accessibility were monitored and improved through lighthouse analytics."
        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-2-145",
            "title": "Implementing a Medical Records Database and Portal for Patients & Doctors",
            "studentName": "Philip Kertsman",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship - Infort Technologies",
            "facultyAdvisor": "Dr. Arkady Retik",
            "posterLink": "./posters/csse/Philip Kertsman.PNG",
            "abstract": "The main aim of this capstone project at Infort Technologies was to work on the development of a medical records database and portal for patients, doctors, and organizations. The team is spread out throughout Europe and North America, with most employees located in the country Georgia. Our team is comprised of front-end developers, back-end developers, designers, and managers. Together we work synchronously and asynchronously to develop all of the aspects of the application. \n\nAs a front-end intern, it was my responsibility to maintain the UI. In order to do this I had to strengthen my knowledge in and leverage the front-end technologies we were using as well as familiarizing myself with our metadata driven architecture. Our front-end utilizes Typescript and React, and I utilized IntelliJ WebStorm as my integrated development environment and NPM to run our scripts. Our metadata provider is Metucat.com. \n\nI have successfully worked with our international distributed team in my nearly 5-months as an intern. We met daily Sunday – Thursday four times a week at 11 PM PST and once for a weekly demo on Thursdays at 11 PM PST. The schedule has worked well for me and I have consistently fixed bugs, added new features, and greatly strengthened my understanding of web development, front-end technologies, back-end technologies, as well as agile Scrum methodology and working with a team that is in another part of the world."
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-2-200",
            "title": "Startup Website Full-Stack Prototype",
            "studentName": "Joshua Roter",
            "studentMajor": "CSSE",
            "projectType": "UWB CSS Faculty Research",
            "facultyAdvisor": "Dr. Arkady Retik",
            "posterLink": "./posters/csse/Josh Alexander Roter.png",
            "abstract": "The main idea behind my capstone was essentially to utilize a full-stack development process to develop a prototype of what would eventually become a usable website to allow students to seek information pertaining to start-ups and entrepreneurships. The site’s main function again is to act as an aggregated source of information that students can utilize while taking Professor Retik’s class regarding start-ups. The idea when designing was to make the site dynamic rather than static while making the site easy to maneuver through as a student. \n\nThis initiated the first process of the capstone which was to design a website that fit these requirements. By utilizing the processes of wireframing through what I learned in CSS 370, I was able to come up with a design for the site that was approved by Professor Retik.  \n\nOnce approved, the task at hand was now to build a functional prototype that was hosted on the cloud. To accomplish these tasks, I had to build an understanding of full-stack application development which meant learning all the necessary tools to help with implementation. These tools were frameworks like REACT.JS along with CSS which helped create the front-end of the prototype. \n\nNext was also learning about the functionality of back-end through frameworks such as Express.JS and NoSQL databases like DynamoDB. Lastly, my final task was to understand the complexities of hosting an application via the cloud which meant researching about all the many appliances that are provided by AWS. After accomplishing these tasks, I was able to develop an understanding of the many different factors that go into fullstack development and what is being utilized in the industry which is exactly what I hoped to learn."
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-2-215",
            "title": "Database Management Internship",
            "studentName": "Mason Honold",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship - Sultan School District",
            "facultyAdvisor": "Dr. Bill Erdly",
            "posterLink": "./posters/csse/Mason Brian Honold.png",
            "abstract": "For my Capstone project, I was employed as an intern for the Sultan School District, working with the IT department. Dave Moon, the head of the department, required help managing their student information system (SIS).\n\nThe Sultan School District is on the small end, and it lacks the budget that larger schools can afford. As a Sultan graduate, I am well aware of the situation and this internship is a great way to give back to the community and help make their lives easier. Dave Moon has inspired many students to pursue careers in technology. When I was informed that he could use help writing SQL queries, I was happy to assist him with working on the student database.\n\nThe district uses software called PowerSchool to manage their database, which operates on a customized Oracle SQL engine. Although Dave knew where most of the data was located, it was hard to locate quickly. My job was to write SQL queries that are saved in reports that could be run at any time. I wrote reports for lunch transactions, students who transferred out, students whose contacts did not have emails, and attendance. I also wrote queries for vendors and whatever else Dave required, including HTML and XML projects. These reports save the district time and money, and reduces the amount of errors when reporting data to the state of Washington. My code was also sent to other school districts for their use. \n\nI got experience working with creating code for actual users and seeing how they use my projects to manage the student body throughout the district. These users provided plenty of feedback for me to incorporate and improve my work. This experience is invaluable and helped me become a much better programmer. I was offered a permanent part-time position with the Sultan School District to continue to write SQL queries for them as needed. I look forward to helping support the District and using what I’ve learned to further my career."
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-2-230",
            "title": "Development of Virtual Reality Vision Therapy",
            "studentName": "Sean Le",
            "studentMajor": "CSSE",
            "projectType": "UWB CSS Faculty Research",
            "facultyAdvisor": "Dr. Bill Erdly",
            "posterLink": "./posters/csse/Sean Le.png",
            "abstract": "According to the Washington Board of Health, around one in four children have some form of vision impairment that impacts their learning. The EYE (Educating Young Eyes) Center Research Group was created in order to develop new solutions that would enable greater accessibility to screenings and vision correction for all children.\n\nFor my capstone, I worked as a developer on the Virtual Reality applications of the EYE Center. My primary responsibilities revolved around maintaining the current VR applications while developing additional VR applications based on requirements given by a vision doctor.\n\nThese applications were built using Unity Engine in conjunction with supporting scripts written in C#. As the current headset used for the research group’s development was the Oculus Rift S, the primary software development kit that was used in Unity was the Oculus SDK.\n\nThe applications that I worked on and developed were made with the intention of identifying and correcting the vision disorder known as strabismus. Strabismus is a disorder where both eyes of a person do not line up in the same direction, also known as crossed eyes.\n\nMy primary contribution on the software side was developing the horizontal and vertical angle test application in VR. This application is designed to test if the user has any signs of strabismus by displaying one arrow in each eye and measuring the angle of deviation when the user believes that the two lines are aligned with each other.\n\nAdditionally, I made non-programming contributions to the research group. In particular, I wrote and integrated design documentation for the VR applications that I had worked on, and most importantly, created a section for the onboarding of new members to expedite the setup period for new team members.\n\nAs a result of my time working with EYE Center, I have been able to obtain an incredible amount of experience working in a team development environment, creating an application from user requirements, and creating design documentation for all of my work. My contributions have set the groundwork for any upcoming members joining the EYE Center Research Group."
        },
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-2-245",
            "title": "Image to Text Translate: An Image OCR and Translation App",
            "studentName": "Quintin Nguyen",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Dr. Bill Erdly",
            "posterLink": "./posters/csse/Quintin Nguyen.jpg",
            "abstract": "This application was created as a means to enhance communication between different languages, especially when it comes to images containing text written in a foreign language that the user is unable to read and understand. \n\nI found that other translation apps, such as Google Translate, are able to detect and translate text within an image, but they do not provide users with any customizations with the translated text and does not allow users to save a copy of the updated image. This meant that the user would have to use the translation app every time they wished to read the text within the image. This made the translation process for images very time-consuming and inefficient for users.\n\nThis need for a more efficient image translation inspired me to create this application. I built the app in Android Studios and tested the application using an emulator. To use the app, I designed it so that the user would identify the number and placement of each textbox. Then I implemented an Optical Character Recognition (OCR) method that would scan the picture for any text in the user-defined areas. Any detected text would then be sent to Google’s Translation servers in order to translate the detected text into the language of the user’s choosing. The translated text would then be overlayed appropriately on top of the image and allows the user many customization options to best fit the needs of the current image. I chose this method of implementation in order to make it easy for the user to use and understand.\n\nAs a result, this application is able to make image translation a lot easier for users than what is currently provided, due to its various customization options and ease of use. The significance of this application is that it is now easier for users of different languages to better communicate and understand each other by making the translation process quick and effortless."
        },
        {
            "time": "3:00 PM - 3:15 PM",
            "projectId": "csse-2-300",
            "title": "OneChat Software Engineering Internship",
            "studentName": "Eun Mi Lee",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship - One Chat",
            "facultyAdvisor": "Dr. Bill Erdly",
            "posterLink": "./posters/csse/Eunmi Lee.png",
            "abstract": "For my capstone project, I worked at OneChat as a software engineer intern over the last two quarters. This capstone was made under the sponsorship of OneChat. OneChat is a startup company that provides privacy preserving chat application service based on AI. My personal goal during the internship was to apply the skills and knowledge that I gained from UWB CSS classes and also expand my industry knowledge of software engineering. \n\nFor the first three months, my majority time was spent with the Mobile Application team, we worked together to create better UI, UX, and wrote code in Java and using Android Studio for primary IDE. My responsibility in this team was related to registration process code, such as checking if a user types in valid email, user ID and password according to the appropriate condition. Most of the codes I made were constructed with simple statements rather than special algorithms.\n\nFor another three months, I was in the cloud computing team. My main task was to establish the server by using Elastic Load Balancer and EC2 to coordinate for managing cloud-based systems and processes and set up the server environment. And also set the database from the Java program to connect to the database, create tables, insert data, get data, delete data and use that database to connect to the mobile using restful in AWS lambda. Through this process I learned much more about cloud computing itself, especially how delivery of different services through the internet, including data storage, servers, databases, networking, and software.\n\nIt was so valuable to have the opportunity to use the skills that I learned at UWB. I believe the knowledge and wisdom gained by OneChat from this capstone will help with the preparation and execution of future jobs. I am going to provide more detail in my presentation."
        },
        {
            "time": "3:15 PM - 3:30 PM",
            "projectId": "csse-2-315",
            "title": "Backend Developer Internship at KyFlex",
            "studentName": "Darren Sumarli",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship - KyFlex",
            "facultyAdvisor": "Dr. Erika Parsons",
            "posterLink": "./posters/csse/Darren Sumarli.png",
            "abstract": "For my capstone internship, I worked as a Backend Developer Intern at KyFlex. KyFlex is a startup based in Columbus, OH, that aims to create a web and mobile platform that allows for users to learn and share experiences. These ‘experiences’ are basically activities that are hosted by an expert(s) and can be shared in a one-on-one to group setting. In this internship, I have learned to develop code with different web development tools such as Django REST Framework, a flexible toolkit for building Web APIs, PostgreSQL, an object-relational database system, and Docker, an environment containerization tool. I spent most of my time working on the implementation of user authentication using OAuth, this includes user registration, email verification, permissions, and social authentication. Besides the technical skills that I have learned, my experience in KyFlex has developed my communication and management skills. KyFlex being a small startup allowed me to experience the weight of my decision and a fast-paced environment. It has taught me to communicate and manage my time with my team as some of the members were on different time zones. Overall, this internship has given me an experience on working in the software development industry."
        }
    ]
}