{
    "csse": [
        {
            "time": "12:30 PM - 12:45 PM",
            "projectId": "csse-4-1230",
            "title": "Software Engineering Internship @ T-Mobile",
            "studentName": "Vy Nguyen",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship - T-Mobile",
            "facultyAdvisor": "Ms. Nancy Kool",
            "posterLink": "./posters/csse/Vy Nguyen.PNG",
            "abstract": "For my capstone internship at T-Mobile US (Summer of 2021 to Summer of 2022), I worked on several projects as part of the Business Operation Management (BOM). T-Mobile is the brand name used by the mobile communication subsidiaries of the German telecommunication company. T-Mobile US is a wireless network operator in America, with 108.7 million subscribers as of the end of Q4 2021. I chose the most recent project to represent my capstone project.\n\nT-Mobile is undergoing a transformation in which multiple teams are trying to move away from storing data in Excel to store in databases. This is because it is time-consuming to retrieve multiple types of data from different files. To solve this pain point, I created a RESTful API that interacts with the MySQL database to retrieve, update, upload reward data, and provide a holistic view of data.\n\nTo build the backend of this project, I used multiple tools and frameworks, including IntelliJ, Spring Boot, SQL Server Management, Postman, and GitLab to build the backend. I built the frontend using Visual Studio Code, React, JavaScript, HTML, CSS, and other independent libraries. My team uses an Agile software development framework. Therefore, I built the software function within a sprint (2-week), getting feedback from users, and iteratively building the next function or integrating the user feedback to make software changes.\n\nFinally, on the thirteenth week after starting this project, I successfully deployed the project so that my team and people from other teams and high-level directors and VP can now use it. My manager estimated that the completion of this project can save my team time alone 200 hours per quarter of time spent looking for historical recognition data to be used to create a report to our team VP.  This time saved is equivalent to $16,000.\n\nIn addition to this accomplishment, through my capstone experience I gained many valuable skills.  Further, I improved my communication skills.  "
        },
        {
            "time": "12:45 PM - 1:00 PM",
            "projectId": "csse-4-1245",
            "title": "Bashpole Software Internship",
            "studentName": "Kristen Maggs",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship - Bashpole Software",
            "facultyAdvisor": "Ms. Nancy Kool",
            "posterLink": "./posters/csse/Kristen Maggs.jpg",
            "abstract": "My capstone software engineering internship at Bashpole Software involved working on PromoterMotor, a service that automates the advertising process for nonprofits. My main project entailed changing the back end to run more efficiently; I was also involved in three smaller projects: 1) working on the front end of specific landing pages, 2) helping to redesign the database, and 3) providing feedback for the company and its training programs.\n\nThe goal of making the PromoterMotor back end run more efficiently was accomplished using Java to change its implementation from JDBC to Hibernate, with MySQL used for parts of testing.  For this project, I used the following tools: Eclipse, Git, Maven, Vagrant, VirtualBox, and the MySQL Workbench and Server. Since I was assigned to work with another intern for this project, we divided the work equally and kept each other updated on our individual progress with daily messages. There were no distinct stages of design, implementation, or testing; rather, there were multiple times when one of us came up with a more efficient way of doing things, causing the other to change their design or implementation to match.\n\nThe project was a success. The back end of the PromoterMotor runs smoothly with its new Hibernate implementation. Through my accomplishments at this internship, I gained valuable knowledge about full-stack development and became familiar with many common technologies and tools used by software developers. I also got better at self-learning by researching new topics, a valuable skill."
        },
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-4-100",
            "title": "Amazon Internship: Product Type Recall Metric & Thresholding Framework",
            "studentName": "Tim Kozlov",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship - Amazon",
            "facultyAdvisor": "Dr. Michael Stiber",
            "posterLink": "./posters/csse/Timothy Kozlov.jpg",
            "abstract": "When browsing products on Amazon.com, it’s possible to filter product types to get more specific search results. But how does Amazon know the type of each product in their catalog? The answer is machine learning. Amazon deploys machine learning models that classify every product listed on Amazon into a product type (PT). My team, the Classification Data Platform, is responsible for developing and producing metrics that help monitor the health of these models. \n\nThroughout my internship at amazon, I had a single project: creating a Spark job that would calculate the model recall for each product type in the Amazon catalog. The reason that I worked on this project was because although our team had a precision metric already, there was nothing in place for measuring recall. This was a huge problem as precision is not affected by false negatives and is therefore unable to detect poor coverage in the same way that recall does. For example, if the product type ‘shirts’ is only applied to 10% of the shirts in the catalog, precision can be 1.0 but recall will be closer to 0.1.\n\nBy the end of my internship, I successfully deployed my spark job so that it began measuring recall for each PT. This metric would calculate and output the result on a weekly basis to an analytics dashboard as well as alarming platform (so that our team could be notified when it dropped below a certain threshold). I also created a custom thresholding framework in Java that was eventually extended to two other metrics. After my internship was completed, my manager reached out to me and told me that my analytics dashboard was used to contest another team on model coverage (recall) and drove them to improve the ML model."
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-4-115",
            "title": "Intelligent Networks Lab",
            "studentName": "Vu Tieu",
            "studentMajor": "CSSE",
            "projectType": "UWB CSS Faculty Research",
            "facultyAdvisor": "Dr. Michael Stiber",
            "posterLink": "./posters/csse/Vu The Tieu.png",
            "abstract": "For my capstone I worked with Professor Stiber on Graph System Analysis. Graph System Analysis is a repository with code to analyzes data from simulations of graph-structured systems. The code I was responsible for under this repository is mostly written in Matlab by Jewel YunHsuan Lee. It analyzes and identifies bursts from spike data. That analysis is then used to produce images and then a movie of bursting behaviors. My job is to understand and provide documentation, reorganize the current burst folder, as well as do performance analysis to see if the code could be improved.\n\nThe purpose of documentation is so that the next person doesn’t spend a significant amount of time understanding what the code does, why it was written the way it is, and how to use it. They would then be able to continue the research and improve current analysis or add new ways to analyze the data. The purpose of performance analysis is to identify bottlenecks in the code. This is important as it could take over two days to run certain code in the repository, and that could further delay the progress of the research. The purpose of reorganization is to remove different version of the same code and sort out which is the most current.\n\nI was able to provide documentation for the main functions used to analyze burst behaviors and sort out which is usable. I updated some syntax as the code was written three years ago. My initial approach in performance analysis was to find code that could be vectorized. I found that the original author had already used vectorization where it could be used mostly. I used the Matlab profiler later on as I understood the code more to time how much each line of code took to run. The profiler helped me identify the bottleneck and improved the runtime of getBurstOrigin and getBurstSpeed. I was not able to find a solution for the bottleneck of getBinnedBurstSpikes which is the function that could take over two days to run. \n\nAlthough I had spent the majority of my capstone learning Matlab and other tools. The documentation I provided I think would be helpful for the future student who will continue this side of the research. I was able to improve the runtime of two functions by a significant amount. I’ve also identified a problem for the future student to solve."
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-4-130",
            "title": "Location-Based Password Strength Feedback System",
            "studentName": "Lisa Waranowitz",
            "studentMajor": "CSSE",
            "projectType": "UWB CSS Faculty Research",
            "facultyAdvisor": "Dr. Marc Dupius",
            "posterLink": "./posters/csse/Lisa A Waranowitz.png",
            "abstract": "In any online account registration system, the registration process often includes a form of password strength feedback. This feedback helps users create passwords that meet mandatory security requirements. While the most basic password strength feedback meters are good enough for the bare minimum, there are many potential ways to incentivise users to create even stronger passwords. With a project by a former student focused on peer-feedback and alternative password meter types as inspiration, for my capstone project I worked on a variation of a password strength feedback system as faculty research with Dr. Dupuis. \n\nThe variation I developed includes one additional aspect: location. Basically, password strength feedback is based on how strong the user’s password is compared to other users in their local area. The registration system requires the user to input their city and country names. Then it uses the specified location to collect the password strengths of users in that same city and other nearby cities. Finally, it evaluates the user’s password strength by calculating its percentile rank among these cities. The purpose of including the location aspect is to see if the user knowing how weak or strong their password is compared to their local peers may motivate them to create a stronger one.To implement the server and middleware, I used NodeJS Express. To display the password strength meter on the registration screen, I used a plugin called the “jQuery Password Strength Meter for Twitter Bootstrap”. I used two APIs, one for geocoding and the other for reverse-geocoding, to retrieve a number of cities surrounding a user’s city. I also used MySQL to create the database.\n\nWorking on this project has helped me learn web development on a deeper level, and strengthened my database skills.Future work would include usability studies in order to determine whether this location feature is a working incentive, writing documentation, and further improving the system’s registration and login features."
        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-4-145",
            "title": "Data Deduplication and Nearest Neighbor Search",
            "studentName": "Fred Chan",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship - Project N",
            "facultyAdvisor": "Dr. Yusuf Pisan",
            "posterLink": "./posters/csse/Fred Chan.png",
            "abstract": "The company I interned at is a stealth startup. The company operates without an officialwebsite, and I had signed a non-disclosure agreement before the interview. The company andmy internship projects focused on data compression for cloud storage, such as AWS S3, andAzure Blob Storage.\n\nI was involved in two projects both are nearest-neighbor search. We want to hash similarobjects into the same bucket, and similar is defined as two binary segments only different in fewbits. The main goal of these projects is to find hashes that are translation invariant of the objectsthey represent. In other words, we want hash collisions. We want similar objects to have thesame or similar hash for the downstream task. These objects are binary segments between 1KBand 4KB of images, videos, text, html web pages, etc.\n\nAt the end of my internship, I was able to conclude that using hashes to perform nearestneighbor search in the production system can be optimized further to find better similar objects.However, the extra compression did not justify the extra computational costs to be adopted as ageneral algorithm.  The new hashing algorithm was retooled to process images only."
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-4-200",
            "title": "Solving Technical Problems",
            "studentName": "Steven Chau",
            "studentMajor": "CSSE",
            "projectType": "UWB CSS Faculty Research",
            "facultyAdvisor": "Dr. Yusuf Pisan",
            "posterLink": "./posters/csse/Steven Hoc Chau.png",
            "abstract": "Interviews for software-related positions typically consist of two distinct parts: behavioral and technical. In technical interviews, applicants are expected to solve programming problems in which they write code and problem-solve in front of the interviewer(s). Unfortunately, as the expectations for entry-level qualifications rise, computer science (CS) students are increasingly having trouble passing these interviews. From this, it is clear that courses involving commonly asked technical interview questions need to be added to traditional CS curriculum. A project was created to address this issue, which offers lessons to help improve students’ problem-solving skills.\n\nThis project is an online course hosted on the e-learning platform, Stepik. In this course, problems from the programming problem-solving website, Leetcode, are used. These problems are commonly asked to applicants in real-world technical interviews and online-assessments. In each course lesson, solutions are given and explained in detail and different approaches are suggested as a way of expanding the student’s thought process when encountering similar problems.\n\nDuring my time working on the project, I was able to contribute to a total of 45 lessons in which I was the author of 18 of them. One problem I wrote a lesson for consisted of finding and returning the extra letter found in one of two nearly identical strings of characters. In this lesson, I introduced two approaches to solving the problem and gave step-by-step explanations for the code solutions. After each solution is a quiz testing the student’s understanding of the time and space efficiency of the approach. This is due to the fact that often, interviewees are asked to explain this during technical interviews, as efficient-running code is valued within the tech industry.\n\nFrom doing this work, I gained a better understanding myself of how to tackle many problems based on the related concept(s). Because of this, I believe that this project would similarly benefit other students struggling with problem-solving."
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-4-215",
            "title": "Beyond the Fundamentals: Prepareing Students for Technical Interviews",
            "studentName": "Brian Clark",
            "studentMajor": "CSSE",
            "projectType": "UWB CSS Faculty Research",
            "facultyAdvisor": "Dr. Yusuf Pisan",
            "posterLink": "./posters/csse/Brian Clark.png",
            "abstract": "School has its place in building a solid foundation. Here, we learn how to implement data structures, we learn the fundamentals. Transitioning out of school and into the real work environment, we need to go beyond the fundamentals.\n\nMany students go through a few technical interviews in applying for an internship and do not meet the requirements. They have been getting good grades in their classes, but they are not able to pass the technical interviews; something is missing.\n\nThe Tech For Good (T4G) Leet Programming project solves this problem; it offers students a path to build on the foundation that school provides. T4G Leet Programming helps students build confidence in their coding abilities by walking them through coding problems of varying difficulty in many topic areas.\n\nTypical coding websites like Leetcode provide solutions for the problems but that does not help the user learn. The T4G Leet Programming project provides a walkthrough approach to learning how to solve the problem. By teaching the user how to think about and solve the problem they will be able to adapt the concepts to a wider range of problems.\n\nThe Leet Programming project also offers topic pathway lessons that help a student become proficient in the associated topic. These lessons provide a path of problems with increasing difficulty and more complex concepts related with the topic so the user can become more experienced and take this knowledge forward.\n\nThrough the work of the T4G team, 219 lessons have been created covering 15 topic areas. The team has also added 7 topic pathway lessons. These lessons have reached 312 users thusfar and continues to grow.\n\nBy creating Stepik course, students have a supplementary course that they can take at their own pace to improve upon the fundamentals that the university courses have built."
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-4-230",
            "title": "Leet Programming Team",
            "studentName": "Eric Westman",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship - Tech4 Good",
            "facultyAdvisor": "Dr. Yusuf Pisan",
            "posterLink": "./posters/csse/Eric Westman2.png",
            "abstract": "The Tech 4 Good (T4G) Leet-Programming team has developed an online learning course with lessons that explore LeetCode problems, and computer science topics. The lessons guide users to final solutions by offering hints and exploring the best approach to solving coding problems. The goal of the project is to help users become better at coding, and also to think about ways to arrive at solutions more efficiently.\n\nMy contributions to this project include building 12 lessons that I thought were interesting, challenging, or that I wanted to learn more about. Problems ranged from string and bit manipulation to using hash tables, arrays, linked lists, and graphs. Some problems were greedy such as Dijkstra’s, and some were dynamic like the KMP algorithm. I also reviewed 22 lessons created by team members by the same criteria, which helped me gain insight into how others solve problems\n\n.I have learned a lot about working in a team, and even more about my own teaching style and how I solve problems. This project has allowed me to be creative and think like a teacher, create graphics and write mini lessons while learning deeply about many types of coding problems. \n\nThis project was a joy to work on, and I am excited to know that it may help many struggling students approach interview questions with much more confidence. The online lessons hosted on Stepik.org will eventually be rolled out to the classroom and integrated into the curriculum for CSS342, 343, either as an addendum, or a teaching tool at the University of Washington Bothell."
        },
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-4-245",
            "title": "iOS Development for the MFB Team at ForeFlight",
            "studentName": "Sam Wolf",
            "studentMajor": "CSSE",
            "projectType": "Current Employer - ForeFlight LLC",
            "facultyAdvisor": "Dr. Yusuf Pisan",
            "posterLink": "./posters/csse/Sam F Wolf.png",
            "abstract": "The MFB (Military Flight Bag), is a team responsible to support Government and Military pilots that specifically use MFB subscriptions. MFB users of ForeFlight find Custom Content very useful in their day-to-day work. GeoTIFF (Geospatial Tagged Image File Format) is a file format requested by customers to be supported with ForeFlight’s Custom Content. This Capstone’s primary focus is on the feature “GeoTIFF Support”. \n\nThe primary approach for this project was to follow the same development pattern that Geospatial PDF used. It was recommended to me as a starting point by management and Senior Rendering Engineers who had created the original support for Geospatial PDF. First step is to extract the geospatial information from the file. After the data is extracted, FFM then needs to create a MapLayer that provides multi-threaded requests to its TileProvider that then draws the GeoTIFF’s raster pixel data on to the map in the correct location on the correct tiles. \n\nThe Capstone development for version 1.0 of GeoTIFF Support took approximately 1000 hours starting in July 2021 and concluded in January 2022 with the release into FFM (ForeFlight Mobile) version 14.0 on the App Store. Key stakeholders were happy for it to launch in the first release of this year. The release was limited to MFB customer due to technical constraints that remain to be solved in a later version."
        },
        {
            "time": "3:00 PM - 3:15 PM",
            "projectId": "csse-4-300",
            "title": "Software Engineering Internship at Avanade",
            "studentName": "Connor Goodman",
            "studentMajor": "CSSE",
            "projectType": "Sponsred Internship - Avanade",
            "facultyAdvisor": "Dr. Yusuf Pisan",
            "posterLink": "./posters/csse/Connor Goodman.jpg",
            "abstract": "For my capstone project last summer, I had the opportunity to intern at Avanade as a Back-End Developer. Avanade is a technology consulting company started as a joint venture between Microsoft and Accenture in 2001. They specialize in helping other companies adopt modern Microsoft tools, including the Power Platform and Microsoft Azure.\n\nAvanade made it clear that their goal was to teach us as much meaningful information as possible over the 10 week internship. The internship kicked off with an innovation challenge where we split into diverse teams with the goal of improving the wellness of employees during Covid. This helped refine our ability to ideate, communicate, and collaborate in a professional setting. The innovation challenge concluded in a group presentation where I practiced public speaking.\n\nThe primary project I worked on was a pitch for an existing tool called Calendar to OneNote. The tool automatically creates OneNote pages for future meetings, speeding up the time it takes to set up notes. On top of creating the pitch, I was tasked with updating the tool with new features. I added a meeting templates feature, and improved the setup process for the tool.\n\nMyself and the interns attended a week-long FUEL conference that included guest speakers from across the tech industry. We gained knowledge about many different facets of technology and leadership. The highlights included AI for Good, virtual reality, and the importance of diversity. The conference ended with a hackathon where my team designed an app that encourages sustainable practices through competition. Our design earned us second place!\n\n While networking throughout the internship, I had the pleasure of meeting an Avanade Solution Architect named Mark. Mark offered to personally mentor me in using Azure Computer Vision services. I happily agreed and every few days we’d collaborate in creating a tool that scans forms for keywords. Mark’s guidance gave me an incredible introduction to cloud computing, computer vision, HTTP, and Jupyter Notebook. \n\nThroughout the internship, I hopped between several projects, developing my career and learning a variety of skills. I’ve become a better leader, speaker, and communicator. Additionally, I have gained insight into the business of technology and possible career opportunities, even realizing my dream of one day becoming a solution architect. After my internship, I accepted a full-time offer from Avanade and am excited to start working there immediately after graduation."
        }
    ]
}